<a href="https://colab.research.google.com/github/LiChiiiii/NLP_jieba/blob/master/nlp_hw01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install jieba
!pip install pandas

Requirement already satisfied: jieba in /usr/local/lib/python3.7/dist-packages (0.42.1)

In [48]:
import jieba
import jieba.analyse
path = 'hw1-dataset.txt'
f = open(path, 'r')
text = []
for line in f.readlines():
    seg_list = jieba.lcut(line, cut_all=False)
    text.append(seg_list)
f.close
text_rows = len(text)
print(text_rows)
print("success")

418202
success

In [31]:
import pandas as pd
arr = groups = [["Movies", 46],["Sports", 8], ["Coding", 12], ["Fishing",12], ["Dancing",6], ["cooking",8]]

df = pd.DataFrame(arr, columns = ["name", "num"]) # 指定欄標籤名稱  
df.head()

      name  num
0   Movies   46
1   Sports    8
2   Coding   12
3  Fishing   12
4  Dancing    6